; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l24_p24_c24_g24_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(carrier-at carrier1 depot)
	(carrier-capacity carrier1 N4)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(person-at person1 loc12)
	(person-at person2 loc6)
	(person-at person3 loc11)
	(person-at person4 loc14)
	(person-at person5 loc2)
	(person-at person6 loc4)
	(person-at person7 loc5)
	(person-at person8 loc23)
	(person-at person9 loc8)
	(person-at person10 loc2)
	(person-at person11 loc19)
	(person-at person12 loc21)
	(person-at person13 loc18)
	(person-at person14 loc20)
	(person-at person15 loc22)
	(person-at person16 loc3)
	(person-at person17 loc1)
	(person-at person18 loc4)
	(person-at person19 loc21)
	(person-at person20 loc7)
	(person-at person21 loc20)
	(person-at person22 loc19)
	(person-at person23 loc4)
	(person-at person24 loc13)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
	(next-num N4 N5)
	(next-num N5 N6)
	(next-num N6 N7)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person18 medicine)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 medicine)
))
)

; plan
1. (put-crate-in-carrier crate24 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate24 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate24 carrier1)
   goals met: 1 of 25
2. (put-crate-in-carrier crate13 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate13 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   goals met: 1 of 25
3. (move-carrier depot loc23 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   goals met: 0 of 25
4. (pick-and-drop crate13 loc23 drone1 carrier1 person8 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate13 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person8 food)
   goals met: 1 of 25
5. (move-carrier loc23 depot drone1 carrier1)
   deleted: (drone-at drone1 loc23) (carrier-at carrier1 loc23)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 25
6. (put-crate-in-carrier crate12 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate12 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   goals met: 2 of 25
7. (move-carrier depot loc21 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   goals met: 1 of 25
8. (pick-and-drop crate24 loc21 drone1 carrier1 person19 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate24 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person19 medicine)
   goals met: 2 of 25
9. (move-carrier loc21 depot drone1 carrier1)
   deleted: (drone-at drone1 loc21) (carrier-at carrier1 loc21)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 25
10. (put-crate-in-carrier crate23 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate23 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate23 carrier1)
   goals met: 3 of 25
11. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 2 of 25
12. (pick-and-drop crate23 loc13 drone1 carrier1 person24 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate23 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person24 medicine)
   goals met: 3 of 25
13. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 25
14. (put-crate-in-carrier crate22 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate22 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate22 carrier1)
   goals met: 4 of 25
15. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 3 of 25
16. (pick-and-drop crate22 loc6 drone1 carrier1 person2 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate22 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person2 medicine)
   goals met: 4 of 25
17. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 25
18. (put-crate-in-carrier crate21 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate21 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate21 carrier1)
   goals met: 5 of 25
19. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 4 of 25
20. (pick-and-drop crate12 loc3 drone1 carrier1 person16 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate12 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person16 food)
   goals met: 5 of 25
21. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 25
22. (put-crate-in-carrier crate11 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate11 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   goals met: 6 of 25
23. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 5 of 25
24. (pick-and-drop crate11 loc1 drone1 carrier1 person17 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate11 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person17 food)
   goals met: 6 of 25
25. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 25
26. (put-crate-in-carrier crate10 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate10 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   goals met: 7 of 25
27. (put-crate-in-carrier crate20 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate20 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate20 carrier1)
   goals met: 7 of 25
28. (move-carrier depot loc22 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc22) (carrier-at carrier1 loc22)
   goals met: 6 of 25
29. (pick-and-drop crate20 loc22 drone1 carrier1 person15 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate20 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person15 medicine)
   goals met: 7 of 25
30. (pick-and-drop crate10 loc22 drone1 carrier1 person15 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate10 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person15 food)
   goals met: 8 of 25
31. (move-carrier loc22 depot drone1 carrier1)
   deleted: (drone-at drone1 loc22) (carrier-at carrier1 loc22)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 25
32. (put-crate-in-carrier crate9 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate9 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   goals met: 9 of 25
33. (put-crate-in-carrier crate19 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate19 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate19 carrier1)
   goals met: 9 of 25
34. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 8 of 25
35. (pick-and-drop crate19 loc19 drone1 carrier1 person11 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate19 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person11 medicine)
   goals met: 9 of 25
36. (pick-and-drop crate9 loc19 drone1 carrier1 person11 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person11 food)
   goals met: 10 of 25
37. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 25
38. (put-crate-in-carrier crate8 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate8 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   goals met: 11 of 25
39. (put-crate-in-carrier crate18 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate18 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate18 carrier1)
   goals met: 11 of 25
40. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 10 of 25
41. (pick-and-drop crate18 loc14 drone1 carrier1 person4 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate18 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person4 medicine)
   goals met: 11 of 25
42. (pick-and-drop crate8 loc14 drone1 carrier1 person4 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person4 food)
   goals met: 12 of 25
43. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 25
44. (put-crate-in-carrier crate7 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate7 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   goals met: 13 of 25
45. (put-crate-in-carrier crate17 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate17 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate17 carrier1)
   goals met: 13 of 25
46. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 12 of 25
47. (pick-and-drop crate17 loc11 drone1 carrier1 person3 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate17 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person3 medicine)
   goals met: 13 of 25
48. (pick-and-drop crate7 loc11 drone1 carrier1 person3 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person3 food)
   goals met: 14 of 25
49. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 25
50. (put-crate-in-carrier crate6 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate6 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   goals met: 15 of 25
51. (put-crate-in-carrier crate16 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate16 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate16 carrier1)
   goals met: 15 of 25
52. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 14 of 25
53. (pick-and-drop crate16 loc7 drone1 carrier1 person20 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate16 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person20 medicine)
   goals met: 15 of 25
54. (pick-and-drop crate6 loc7 drone1 carrier1 person20 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person20 food)
   goals met: 16 of 25
55. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 25
56. (put-crate-in-carrier crate5 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   goals met: 17 of 25
57. (put-crate-in-carrier crate15 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate15 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate15 carrier1)
   goals met: 17 of 25
58. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 16 of 25
59. (pick-and-drop crate15 loc5 drone1 carrier1 person7 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate15 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person7 medicine)
   goals met: 17 of 25
60. (pick-and-drop crate5 loc5 drone1 carrier1 person7 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person7 food)
   goals met: 18 of 25
61. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 25
62. (put-crate-in-carrier crate4 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   goals met: 19 of 25
63. (put-crate-in-carrier crate14 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate14 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate14 carrier1)
   goals met: 19 of 25
64. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 18 of 25
65. (pick-and-drop crate14 loc4 drone1 carrier1 person18 medicine n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate14 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person18 medicine)
   goals met: 19 of 25
66. (pick-and-drop crate21 loc4 drone1 carrier1 person23 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate21 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person23 medicine)
   goals met: 20 of 25
67. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 21 of 25
68. (put-crate-in-carrier crate3 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   goals met: 21 of 25
69. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 20 of 25
70. (pick-and-drop crate3 loc4 drone1 carrier1 person18 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person18 food)
   goals met: 21 of 25
71. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 22 of 25
72. (put-crate-in-carrier crate2 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   goals met: 22 of 25
73. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 21 of 25
74. (pick-and-drop crate2 loc4 drone1 carrier1 person23 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person23 food)
   goals met: 22 of 25
75. (move-carrier loc4 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 22 of 25
76. (pick-and-drop crate4 loc2 drone1 carrier1 person5 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person5 food)
   goals met: 23 of 25
77. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 24 of 25
78. (put-crate-in-carrier crate1 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   goals met: 24 of 25
79. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 23 of 25
80. (pick-and-drop crate1 loc2 drone1 carrier1 person10 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person10 food)
   goals met: 24 of 25
81. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 25 of 25
